app/views/events/index.html.erb

                    <td><%= event.city %></td>
                    <td><%= event.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

                            <a href="/events/<%= event.id %>/edit">Edit</a> | <a href="/events/<%= event.id %>" data-method="delete">Delete</a>
                        <% elsif event.users_joined.include?(current_user) %>
---
SELECT  1 AS one FROM "users" INNER JOIN "attendees" ON "users"."id" = "attendees"."user_id" WHERE "attendees"."event_id" = $1 AND "users"."id" = $2 LIMIT 1  [["event_id", 1], ["id", 1]]