app/views/events/show.html.erb

<h2><%= @event.name %></h2>
<p>Host : <%= @event.user.first_name %></p>
---
SELECT "users".* FROM "users" INNER JOIN "attendees" ON "users"."id" = "attendees"."user_id" WHERE "attendees"."event_id" = $1  [["event_id", 2]]

<p>Location : <%= @event.city %></p>
<p>People who are joining the event : <%= @event.users_joined.count %></p>
---
SELECT COUNT(*) FROM "users" INNER JOIN "attendees" ON "users"."id" = "attendees"."user_id" WHERE "attendees"."event_id" = $1  [["event_id", 1]]