app/controllers/attendees_controller.rb

INSERT INTO "attendees" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["created_at", "2018-06-21 13:45:36.461069"], ["updated_at", "2018-06-21 13:45:36.461069"]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."user_id" = 1
---
  def create
    Attendee.create(user: current_user, event: Event.find(params[:id]))

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."event_id" = $1 LIMIT 1  [["event_id", 5]]
DELETE FROM "attendees" WHERE "attendees"."id" = $1  [["id", 3]]
---
  def destroy
  	attendee = Attendee.find_by(event_id: params[:id])
  	attendee.destroy