app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "context", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "3"], ["context", "sdfsdfdsfdsfdsfds"], ["event_id", 2], ["created_at", "2018-06-21 21:49:43.621426"], ["updated_at", "2018-06-21 21:49:43.621426"]]
---
  def create
  	Comment.create(author: current_user.first_name, context: params[:context], event_id: params[:id])