app/controllers/events_controller.rb

  def index
    # @in_state_events = Event.all.where(state: current_user.state)
    # @out_state_events = Event.all.where.not(state: current_user.state)
    @in_state_events = Event.eager_load(:user, :users_joined).where(state: current_user.state)
---
SELECT "events".* FROM "events" WHERE ("events"."state" != $1)  [["state", "HI"]]

  def create
      event = Event.create(event_params)
      event.user_id = current_user.id
      event.save
---
INSERT INTO "events" ("name", "date", "city", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Garage Sale"], ["date", "2018-11-28"], ["city", "Mountain View"], ["state", "CA"], ["created_at", "2018-06-21 18:49:39.092870"], ["updated_at", "2018-06-21 18:49:39.092870"]]
UPDATE "events" SET "user_id" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["user_id", 10], ["updated_at", "2018-06-21 19:14:36.704805"], ["id", 9]]

  def destroy
  	event = Event.find(params[:id])
  	event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 9]]

  def update
  	event = Event.find(params[:id])
  	event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 12]]
UPDATE "events" SET "name" = $1, "date" = $2, "city" = $3, "state" = $4, "updated_at" = $5 WHERE "events"."id" = $6  [["name", "Destroy your car"], ["date", "2018-06-29"], ["city", "Back yard"], ["state", "CA"], ["updated_at", "2018-06-21 20:47:13.631034"], ["id", 10]]