app/controllers/sessions_controller.rb

  def create
    # if authenticate true
    user = User.find_by_email(params[:user][:email]).try(:authenticate, params[:user][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "derek@han.com"]]