app/controllers/users_controller.rb

  def create
    if params[:user][:password] == params[:user][:password_confirmation]
      new_user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "city", "state", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    user = User.find(params[:id])
    user.update(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], city: params[:city], state: params[:state])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "first_name" = $1, "state" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "derek"], ["state", "AL"], ["updated_at", "2018-07-13 19:47:22.995455"], ["id", 1]]